app/views/users/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---

     <% @user.photos.each do |photo| %>

SELECT  "likes".* FROM "likes" WHERE "likes"."photo_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["photo_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
       <p>
         <% if photo.likes.find_by(:user_id => current_user.id) == nil %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---

       <% photo.comments.each do |comment| %>