app/controllers/likes_controller.rb

  def create
    @like = Like.new

    @like.user_id = params[:user_id]
    @like.photo_id = params[:photo_id]

    save_status = @like.save
---
INSERT INTO "likes" ("user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["created_at", 2017-03-01 08:13:46 UTC], ["updated_at", 2017-03-01 08:13:46 UTC]]