app/controllers/users_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
  def liked
    @likes = Like.where( :user_id => current_user.id)